MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAS176/mcu.h
extern volatile __SPI5CONbits_t SPI5CONbits __asm__ ("SPI5CON") __attribute__((section("sfrs"), address(0xBF821800)));
extern volatile uint32_t        SPI5CONCLR __attribute__((section("sfrs"),address(0xBF821804)));
extern volatile uint32_t        SPI5CONSET __attribute__((section("sfrs"),address(0xBF821808)));
extern volatile uint32_t        SPI5CONINV __attribute__((section("sfrs"),address(0xBF82180C)));
#define SPI5STAT SPI5STAT
extern volatile uint32_t   SPI5STAT __attribute__((section("sfrs"), address(0xBF821810)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI5STATbits_t;
extern volatile __SPI5STATbits_t SPI5STATbits __asm__ ("SPI5STAT") __attribute__((section("sfrs"), address(0xBF821810)));
extern volatile uint32_t        SPI5STATCLR __attribute__((section("sfrs"),address(0xBF821814)));
extern volatile uint32_t        SPI5STATSET __attribute__((section("sfrs"),address(0xBF821818)));
extern volatile uint32_t        SPI5STATINV __attribute__((section("sfrs"),address(0xBF82181C)));
#define SPI5BUF SPI5BUF
extern volatile uint32_t   SPI5BUF __attribute__((section("sfrs"), address(0xBF821820)));
#define SPI5BRG SPI5BRG
extern volatile uint32_t   SPI5BRG __attribute__((section("sfrs"), address(0xBF821830)));
extern volatile uint32_t        SPI5BRGCLR __attribute__((section("sfrs"),address(0xBF821834)));
extern volatile uint32_t        SPI5BRGSET __attribute__((section("sfrs"),address(0xBF821838)));
extern volatile uint32_t        SPI5BRGINV __attribute__((section("sfrs"),address(0xBF82183C)));
#define SPI5CON2 SPI5CON2
extern volatile uint32_t   SPI5CON2 __attribute__((section("sfrs"), address(0xBF821840)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI5CON2bits_t;
extern volatile __SPI5CON2bits_t SPI5CON2bits __asm__ ("SPI5CON2") __attribute__((section("sfrs"), address(0xBF821840)));
extern volatile uint32_t        SPI5CON2CLR __attribute__((section("sfrs"),address(0xBF821844)));
extern volatile uint32_t        SPI5CON2SET __attribute__((section("sfrs"),address(0xBF821848)));
extern volatile uint32_t        SPI5CON2INV __attribute__((section("sfrs"),address(0xBF82184C)));
#define SPI6CON SPI6CON
extern volatile uint32_t   SPI6CON __attribute__((section("sfrs"), address(0xBF821A00)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI6CONbits_t;
extern volatile __SPI6CONbits_t SPI6CONbits __asm__ ("SPI6CON") __attribute__((section("sfrs"), address(0xBF821A00)));
extern volatile uint32_t        SPI6CONCLR __attribute__((section("sfrs"),address(0xBF821A04)));
extern volatile uint32_t        SPI6CONSET __attribute__((section("sfrs"),address(0xBF821A08)));
extern volatile uint32_t        SPI6CONINV __attribute__((section("sfrs"),address(0xBF821A0C)));
#define SPI6STAT SPI6STAT
extern volatile uint32_t   SPI6STAT __attribute__((section("sfrs"), address(0xBF821A10)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI6STATbits_t;
extern volatile __SPI6STATbits_t SPI6STATbits __asm__ ("SPI6STAT") __attribute__((section("sfrs"), address(0xBF821A10)));
extern volatile uint32_t        SPI6STATCLR __attribute__((section("sfrs"),address(0xBF821A14)));
extern volatile uint32_t        SPI6STATSET __attribute__((section("sfrs"),address(0xBF821A18)));
extern volatile uint32_t        SPI6STATINV __attribute__((section("sfrs"),address(0xBF821A1C)));
#define SPI6BUF SPI6BUF
extern volatile uint32_t   SPI6BUF __attribute__((section("sfrs"), address(0xBF821A20)));
#define SPI6BRG SPI6BRG
extern volatile uint32_t   SPI6BRG __attribute__((section("sfrs"), address(0xBF821A30)));
extern volatile uint32_t        SPI6BRGCLR __attribute__((section("sfrs"),address(0xBF821A34)));
extern volatile uint32_t        SPI6BRGSET __attribute__((section("sfrs"),address(0xBF821A38)));
extern volatile uint32_t        SPI6BRGINV __attribute__((section("sfrs"),address(0xBF821A3C)));
#define SPI6CON2 SPI6CON2
extern volatile uint32_t   SPI6CON2 __attribute__((section("sfrs"), address(0xBF821A40)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI6CON2bits_t;
extern volatile __SPI6CON2bits_t SPI6CON2bits __asm__ ("SPI6CON2") __attribute__((section("sfrs"), address(0xBF821A40)));
extern volatile uint32_t        SPI6CON2CLR __attribute__((section("sfrs"),address(0xBF821A44)));
extern volatile uint32_t        SPI6CON2SET __attribute__((section("sfrs"),address(0xBF821A48)));
extern volatile uint32_t        SPI6CON2INV __attribute__((section("sfrs"),address(0xBF821A4C)));
#define U1MODE U1MODE
extern volatile uint32_t   U1MODE __attribute__((section("sfrs"), address(0xBF822000)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U1MODEbits_t;
extern volatile __U1MODEbits_t U1MODEbits __asm__ ("U1MODE") __attribute__((section("sfrs"), address(0xBF822000)));
extern volatile uint32_t        U1MODECLR __attribute__((section("sfrs"),address(0xBF822004)));
extern volatile uint32_t        U1MODESET __attribute__((section("sfrs"),address(0xBF822008)));
extern volatile uint32_t        U1MODEINV __attribute__((section("sfrs"),address(0xBF82200C)));
#define U1STA U1STA
extern volatile uint32_t   U1STA __attribute__((section("sfrs"), address(0xBF822010)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U1STAbits_t;
