MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAS176/mcu.h
extern volatile __C1FIFOINT7bits_t C1FIFOINT7bits __asm__ ("C1FIFOINT7") __attribute__((section("sfrs"), address(0xBF880520)));
extern volatile uint32_t        C1FIFOINT7CLR __attribute__((section("sfrs"),address(0xBF880524)));
extern volatile uint32_t        C1FIFOINT7SET __attribute__((section("sfrs"),address(0xBF880528)));
extern volatile uint32_t        C1FIFOINT7INV __attribute__((section("sfrs"),address(0xBF88052C)));
#define C1FIFOUA7 C1FIFOUA7
extern volatile uint32_t   C1FIFOUA7 __attribute__((section("sfrs"), address(0xBF880530)));
extern volatile uint32_t        C1FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF880534)));
extern volatile uint32_t        C1FIFOUA7SET __attribute__((section("sfrs"),address(0xBF880538)));
extern volatile uint32_t        C1FIFOUA7INV __attribute__((section("sfrs"),address(0xBF88053C)));
#define C1FIFOCI7 C1FIFOCI7
extern volatile uint32_t   C1FIFOCI7 __attribute__((section("sfrs"), address(0xBF880540)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI7bits_t;
extern volatile __C1FIFOCI7bits_t C1FIFOCI7bits __asm__ ("C1FIFOCI7") __attribute__((section("sfrs"), address(0xBF880540)));
extern volatile uint32_t        C1FIFOCI7CLR __attribute__((section("sfrs"),address(0xBF880544)));
extern volatile uint32_t        C1FIFOCI7SET __attribute__((section("sfrs"),address(0xBF880548)));
extern volatile uint32_t        C1FIFOCI7INV __attribute__((section("sfrs"),address(0xBF88054C)));
#define C1FIFOCON8 C1FIFOCON8
extern volatile uint32_t   C1FIFOCON8 __attribute__((section("sfrs"), address(0xBF880550)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON8bits_t;
extern volatile __C1FIFOCON8bits_t C1FIFOCON8bits __asm__ ("C1FIFOCON8") __attribute__((section("sfrs"), address(0xBF880550)));
extern volatile uint32_t        C1FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF880554)));
extern volatile uint32_t        C1FIFOCON8SET __attribute__((section("sfrs"),address(0xBF880558)));
extern volatile uint32_t        C1FIFOCON8INV __attribute__((section("sfrs"),address(0xBF88055C)));
#define C1FIFOINT8 C1FIFOINT8
extern volatile uint32_t   C1FIFOINT8 __attribute__((section("sfrs"), address(0xBF880560)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT8bits_t;
extern volatile __C1FIFOINT8bits_t C1FIFOINT8bits __asm__ ("C1FIFOINT8") __attribute__((section("sfrs"), address(0xBF880560)));
extern volatile uint32_t        C1FIFOINT8CLR __attribute__((section("sfrs"),address(0xBF880564)));
extern volatile uint32_t        C1FIFOINT8SET __attribute__((section("sfrs"),address(0xBF880568)));
extern volatile uint32_t        C1FIFOINT8INV __attribute__((section("sfrs"),address(0xBF88056C)));
#define C1FIFOUA8 C1FIFOUA8
extern volatile uint32_t   C1FIFOUA8 __attribute__((section("sfrs"), address(0xBF880570)));
extern volatile uint32_t        C1FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF880574)));
extern volatile uint32_t        C1FIFOUA8SET __attribute__((section("sfrs"),address(0xBF880578)));
extern volatile uint32_t        C1FIFOUA8INV __attribute__((section("sfrs"),address(0xBF88057C)));
#define C1FIFOCI8 C1FIFOCI8
extern volatile uint32_t   C1FIFOCI8 __attribute__((section("sfrs"), address(0xBF880580)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI8bits_t;
extern volatile __C1FIFOCI8bits_t C1FIFOCI8bits __asm__ ("C1FIFOCI8") __attribute__((section("sfrs"), address(0xBF880580)));
extern volatile uint32_t        C1FIFOCI8CLR __attribute__((section("sfrs"),address(0xBF880584)));
extern volatile uint32_t        C1FIFOCI8SET __attribute__((section("sfrs"),address(0xBF880588)));
extern volatile uint32_t        C1FIFOCI8INV __attribute__((section("sfrs"),address(0xBF88058C)));
#define C1FIFOCON9 C1FIFOCON9
extern volatile uint32_t   C1FIFOCON9 __attribute__((section("sfrs"), address(0xBF880590)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON9bits_t;
extern volatile __C1FIFOCON9bits_t C1FIFOCON9bits __asm__ ("C1FIFOCON9") __attribute__((section("sfrs"), address(0xBF880590)));
extern volatile uint32_t        C1FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF880594)));
extern volatile uint32_t        C1FIFOCON9SET __attribute__((section("sfrs"),address(0xBF880598)));
extern volatile uint32_t        C1FIFOCON9INV __attribute__((section("sfrs"),address(0xBF88059C)));
#define C1FIFOINT9 C1FIFOINT9
extern volatile uint32_t   C1FIFOINT9 __attribute__((section("sfrs"), address(0xBF8805A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT9bits_t;
extern volatile __C1FIFOINT9bits_t C1FIFOINT9bits __asm__ ("C1FIFOINT9") __attribute__((section("sfrs"), address(0xBF8805A0)));
extern volatile uint32_t        C1FIFOINT9CLR __attribute__((section("sfrs"),address(0xBF8805A4)));
extern volatile uint32_t        C1FIFOINT9SET __attribute__((section("sfrs"),address(0xBF8805A8)));
extern volatile uint32_t        C1FIFOINT9INV __attribute__((section("sfrs"),address(0xBF8805AC)));
#define C1FIFOUA9 C1FIFOUA9
extern volatile uint32_t   C1FIFOUA9 __attribute__((section("sfrs"), address(0xBF8805B0)));
extern volatile uint32_t        C1FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF8805B4)));
extern volatile uint32_t        C1FIFOUA9SET __attribute__((section("sfrs"),address(0xBF8805B8)));
extern volatile uint32_t        C1FIFOUA9INV __attribute__((section("sfrs"),address(0xBF8805BC)));
#define C1FIFOCI9 C1FIFOCI9
extern volatile uint32_t   C1FIFOCI9 __attribute__((section("sfrs"), address(0xBF8805C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI9bits_t;
extern volatile __C1FIFOCI9bits_t C1FIFOCI9bits __asm__ ("C1FIFOCI9") __attribute__((section("sfrs"), address(0xBF8805C0)));
extern volatile uint32_t        C1FIFOCI9CLR __attribute__((section("sfrs"),address(0xBF8805C4)));
extern volatile uint32_t        C1FIFOCI9SET __attribute__((section("sfrs"),address(0xBF8805C8)));
extern volatile uint32_t        C1FIFOCI9INV __attribute__((section("sfrs"),address(0xBF8805CC)));
#define C1FIFOCON10 C1FIFOCON10
extern volatile uint32_t   C1FIFOCON10 __attribute__((section("sfrs"), address(0xBF8805D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON10bits_t;
extern volatile __C1FIFOCON10bits_t C1FIFOCON10bits __asm__ ("C1FIFOCON10") __attribute__((section("sfrs"), address(0xBF8805D0)));
extern volatile uint32_t        C1FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF8805D4)));
extern volatile uint32_t        C1FIFOCON10SET __attribute__((section("sfrs"),address(0xBF8805D8)));
extern volatile uint32_t        C1FIFOCON10INV __attribute__((section("sfrs"),address(0xBF8805DC)));
#define C1FIFOINT10 C1FIFOINT10
extern volatile uint32_t   C1FIFOINT10 __attribute__((section("sfrs"), address(0xBF8805E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT10bits_t;
extern volatile __C1FIFOINT10bits_t C1FIFOINT10bits __asm__ ("C1FIFOINT10") __attribute__((section("sfrs"), address(0xBF8805E0)));
extern volatile uint32_t        C1FIFOINT10CLR __attribute__((section("sfrs"),address(0xBF8805E4)));
extern volatile uint32_t        C1FIFOINT10SET __attribute__((section("sfrs"),address(0xBF8805E8)));
extern volatile uint32_t        C1FIFOINT10INV __attribute__((section("sfrs"),address(0xBF8805EC)));
#define C1FIFOUA10 C1FIFOUA10
extern volatile uint32_t   C1FIFOUA10 __attribute__((section("sfrs"), address(0xBF8805F0)));
extern volatile uint32_t        C1FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF8805F4)));
extern volatile uint32_t        C1FIFOUA10SET __attribute__((section("sfrs"),address(0xBF8805F8)));
extern volatile uint32_t        C1FIFOUA10INV __attribute__((section("sfrs"),address(0xBF8805FC)));
#define C1FIFOCI10 C1FIFOCI10
extern volatile uint32_t   C1FIFOCI10 __attribute__((section("sfrs"), address(0xBF880600)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI10bits_t;
extern volatile __C1FIFOCI10bits_t C1FIFOCI10bits __asm__ ("C1FIFOCI10") __attribute__((section("sfrs"), address(0xBF880600)));
extern volatile uint32_t        C1FIFOCI10CLR __attribute__((section("sfrs"),address(0xBF880604)));
extern volatile uint32_t        C1FIFOCI10SET __attribute__((section("sfrs"),address(0xBF880608)));
extern volatile uint32_t        C1FIFOCI10INV __attribute__((section("sfrs"),address(0xBF88060C)));
#define C1FIFOCON11 C1FIFOCON11
extern volatile uint32_t   C1FIFOCON11 __attribute__((section("sfrs"), address(0xBF880610)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON11bits_t;
extern volatile __C1FIFOCON11bits_t C1FIFOCON11bits __asm__ ("C1FIFOCON11") __attribute__((section("sfrs"), address(0xBF880610)));
extern volatile uint32_t        C1FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF880614)));
extern volatile uint32_t        C1FIFOCON11SET __attribute__((section("sfrs"),address(0xBF880618)));
extern volatile uint32_t        C1FIFOCON11INV __attribute__((section("sfrs"),address(0xBF88061C)));
#define C1FIFOINT11 C1FIFOINT11
extern volatile uint32_t   C1FIFOINT11 __attribute__((section("sfrs"), address(0xBF880620)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT11bits_t;
