MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAS176/mcu.h
extern volatile __EMACxSA0bits_t EMACxSA0bits __asm__ ("EMACxSA0") __attribute__((section("sfrs"), address(0xBF882300)));
extern volatile uint32_t        EMAC1SA0CLR __attribute__((section("sfrs"),address(0xBF882304)));
extern volatile uint32_t        EMACxSA0CLR __attribute__((section("sfrs"),address(0xBF882304)));
extern volatile uint32_t        EMAC1SA0SET __attribute__((section("sfrs"),address(0xBF882308)));
extern volatile uint32_t        EMACxSA0SET __attribute__((section("sfrs"),address(0xBF882308)));
extern volatile uint32_t        EMAC1SA0INV __attribute__((section("sfrs"),address(0xBF88230C)));
extern volatile uint32_t        EMACxSA0INV __attribute__((section("sfrs"),address(0xBF88230C)));
#define EMAC1SA1 EMAC1SA1
extern volatile uint32_t   EMAC1SA1 __attribute__((section("sfrs"), address(0xBF882310)));
typedef union {
  struct {
    uint32_t STNADDR3:8;
    uint32_t STNADDR4:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1SA1bits_t;
extern volatile __EMAC1SA1bits_t EMAC1SA1bits __asm__ ("EMAC1SA1") __attribute__((section("sfrs"), address(0xBF882310)));
#define EMACxSA1 EMACxSA1
extern volatile uint32_t   EMACxSA1 __attribute__((section("sfrs"), address(0xBF882310)));
typedef union {
  struct {
    uint32_t STNADDR3:8;
    uint32_t STNADDR4:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxSA1bits_t;
extern volatile __EMACxSA1bits_t EMACxSA1bits __asm__ ("EMACxSA1") __attribute__((section("sfrs"), address(0xBF882310)));
extern volatile uint32_t        EMAC1SA1CLR __attribute__((section("sfrs"),address(0xBF882314)));
extern volatile uint32_t        EMACxSA1CLR __attribute__((section("sfrs"),address(0xBF882314)));
extern volatile uint32_t        EMAC1SA1SET __attribute__((section("sfrs"),address(0xBF882318)));
extern volatile uint32_t        EMACxSA1SET __attribute__((section("sfrs"),address(0xBF882318)));
extern volatile uint32_t        EMAC1SA1INV __attribute__((section("sfrs"),address(0xBF88231C)));
extern volatile uint32_t        EMACxSA1INV __attribute__((section("sfrs"),address(0xBF88231C)));
#define EMAC1SA2 EMAC1SA2
extern volatile uint32_t   EMAC1SA2 __attribute__((section("sfrs"), address(0xBF882320)));
typedef union {
  struct {
    uint32_t STNADDR1:8;
    uint32_t STNADDR2:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1SA2bits_t;
extern volatile __EMAC1SA2bits_t EMAC1SA2bits __asm__ ("EMAC1SA2") __attribute__((section("sfrs"), address(0xBF882320)));
#define EMACxSA2 EMACxSA2
extern volatile uint32_t   EMACxSA2 __attribute__((section("sfrs"), address(0xBF882320)));
typedef union {
  struct {
    uint32_t STNADDR1:8;
    uint32_t STNADDR2:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxSA2bits_t;
extern volatile __EMACxSA2bits_t EMACxSA2bits __asm__ ("EMACxSA2") __attribute__((section("sfrs"), address(0xBF882320)));
extern volatile uint32_t        EMAC1SA2CLR __attribute__((section("sfrs"),address(0xBF882324)));
extern volatile uint32_t        EMACxSA2CLR __attribute__((section("sfrs"),address(0xBF882324)));
extern volatile uint32_t        EMAC1SA2SET __attribute__((section("sfrs"),address(0xBF882328)));
extern volatile uint32_t        EMACxSA2SET __attribute__((section("sfrs"),address(0xBF882328)));
extern volatile uint32_t        EMAC1SA2INV __attribute__((section("sfrs"),address(0xBF88232C)));
extern volatile uint32_t        EMACxSA2INV __attribute__((section("sfrs"),address(0xBF88232C)));
#define USBCRCON USBCRCON
extern volatile uint32_t   USBCRCON __attribute__((section("sfrs"), address(0xBF884000)));
typedef struct {
  uint32_t USBWKUPEN:1;
  uint32_t USBRIE:1;
  uint32_t USBIE:1;
  uint32_t SENDMONEN:1;
  uint32_t BSVALMONEN:1;
  uint32_t ASVALMONEN:1;
  uint32_t VBUSMONEN:1;
  uint32_t PHYIDEN:1;
  uint32_t USBIDVAL:1;
  uint32_t USBIDOVEN:1;
  uint32_t :14;
  uint32_t USBWKUP:1;
  uint32_t USBRF:1;
  uint32_t USBIF:1;
} __USBCRCONbits_t;
extern volatile __USBCRCONbits_t USBCRCONbits __asm__ ("USBCRCON") __attribute__((section("sfrs"), address(0xBF884000)));
#define RTCCON RTCCON
extern volatile uint32_t   RTCCON __attribute__((section("sfrs"), address(0xBF8C0000)));
typedef union {
  struct {
    uint32_t RTCOE:1;
    uint32_t HALFSEC:1;
    uint32_t RTCSYNC:1;
    uint32_t RTCWREN:1;
    uint32_t :2;
    uint32_t RTCCLKON:1;
    uint32_t RTCOUTSEL:2;
    uint32_t RTCCLKSEL:2;
    uint32_t :2;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t CAL:10;
  };
  struct {
    uint32_t w:32;
  };
} __RTCCONbits_t;
extern volatile __RTCCONbits_t RTCCONbits __asm__ ("RTCCON") __attribute__((section("sfrs"), address(0xBF8C0000)));
extern volatile uint32_t        RTCCONCLR __attribute__((section("sfrs"),address(0xBF8C0004)));
extern volatile uint32_t        RTCCONSET __attribute__((section("sfrs"),address(0xBF8C0008)));
extern volatile uint32_t        RTCCONINV __attribute__((section("sfrs"),address(0xBF8C000C)));
#define RTCALRM RTCALRM
extern volatile uint32_t   RTCALRM __attribute__((section("sfrs"), address(0xBF8C0010)));
typedef union {
  struct {
    uint32_t ARPT:8;
    uint32_t AMASK:4;
    uint32_t ALRMSYNC:1;
    uint32_t PIV:1;
    uint32_t CHIME:1;
    uint32_t ALRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __RTCALRMbits_t;
extern volatile __RTCALRMbits_t RTCALRMbits __asm__ ("RTCALRM") __attribute__((section("sfrs"), address(0xBF8C0010)));
extern volatile uint32_t        RTCALRMCLR __attribute__((section("sfrs"),address(0xBF8C0014)));
extern volatile uint32_t        RTCALRMSET __attribute__((section("sfrs"),address(0xBF8C0018)));
extern volatile uint32_t        RTCALRMINV __attribute__((section("sfrs"),address(0xBF8C001C)));
#define RTCTIME RTCTIME
extern volatile uint32_t   RTCTIME __attribute__((section("sfrs"), address(0xBF8C0020)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCTIMEbits_t;
extern volatile __RTCTIMEbits_t RTCTIMEbits __asm__ ("RTCTIME") __attribute__((section("sfrs"), address(0xBF8C0020)));
extern volatile uint32_t        RTCTIMECLR __attribute__((section("sfrs"),address(0xBF8C0024)));
extern volatile uint32_t        RTCTIMESET __attribute__((section("sfrs"),address(0xBF8C0028)));
extern volatile uint32_t        RTCTIMEINV __attribute__((section("sfrs"),address(0xBF8C002C)));
#define RTCDATE RTCDATE
extern volatile uint32_t   RTCDATE __attribute__((section("sfrs"), address(0xBF8C0030)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
    uint32_t YEAR01:4;
    uint32_t YEAR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCDATEbits_t;
extern volatile __RTCDATEbits_t RTCDATEbits __asm__ ("RTCDATE") __attribute__((section("sfrs"), address(0xBF8C0030)));
extern volatile uint32_t        RTCDATECLR __attribute__((section("sfrs"),address(0xBF8C0034)));
extern volatile uint32_t        RTCDATESET __attribute__((section("sfrs"),address(0xBF8C0038)));
extern volatile uint32_t        RTCDATEINV __attribute__((section("sfrs"),address(0xBF8C003C)));
#define ALRMTIME ALRMTIME
extern volatile uint32_t   ALRMTIME __attribute__((section("sfrs"), address(0xBF8C0040)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMTIMEbits_t;
extern volatile __ALRMTIMEbits_t ALRMTIMEbits __asm__ ("ALRMTIME") __attribute__((section("sfrs"), address(0xBF8C0040)));
extern volatile uint32_t        ALRMTIMECLR __attribute__((section("sfrs"),address(0xBF8C0044)));
extern volatile uint32_t        ALRMTIMESET __attribute__((section("sfrs"),address(0xBF8C0048)));
extern volatile uint32_t        ALRMTIMEINV __attribute__((section("sfrs"),address(0xBF8C004C)));
#define ALRMDATE ALRMDATE
extern volatile uint32_t   ALRMDATE __attribute__((section("sfrs"), address(0xBF8C0050)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMDATEbits_t;
